app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows` FROM `tb_buku`
SELECT COUNT(*) AS `numrows` FROM `tb_peminjam`
---
    public function dashboard(){
        $totalBuku = $this->buku->countAll();
        $totalPeminjam = $this->peminjam->countAll();

SELECT *
FROM `tb_buku`
---
    public function databuku(){
        $getdata = $this->buku->findAll();

SELECT *
FROM `tb_buku`
WHERE `tb_buku`.`kode_buku` = 'B002'
---
    public function detailbuku($kode_buku){
        $data['databuku'] = $this->buku->find($kode_buku);