app/Models/PeminjamModel.php

    public function countDipinjam()
    {
        return $this->where('status', 'dipinjam')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_peminjam`
WHERE `status` = 'dipinjam'

    public function countDikembalikan()
    {
        return $this->where('status', 'dikembalikan')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_peminjam`
WHERE `status` = 'dikembalikan'

    public function getJudulBuku()
    {
        $query = $this->db->table('tb_peminjam p')
        ->join('tb_buku b', 'b.kode_buku = p.kode_buku', 'left')
        ->select('p.*, b.kode_buku, b.judul_buku')
        ->get();
---
SELECT `p`.*, `b`.`kode_buku`, `b`.`judul_buku`
FROM `tb_peminjam` `p`
LEFT JOIN `tb_buku` `b` ON `b`.`kode_buku` = `p`.`kode_buku`