app/Models/UsersModel.php

    public function getUserByLogin($user_name, $password)
    {
        $user = $this->where('user_name', $user_name)
                     ->first();
---
SELECT *
FROM `tb_users`
WHERE `user_name` = 'admin'
 LIMIT 1